In [1]:
import pandas as pd

In [8]:
import numpy
import pandas
labels=['a','b','c']
my_list=[10,20,30]
d={'a':10,'b':20,'c':30}
a=pandas.Series(d)
print(a['a'])
print(a['c'])
print(a)

10
30
a    10
b    20
c    30
dtype: int64

In [14]:
import numpy
import pandas
my_list=[10,20,30,40,50]
ind=['!','@','#','$','%']
a=pandas.Series(index=ind,data=my_list)
print(a)

!    10
@    20
#    30
$    40
%    50
dtype: int64

In [16]:
import numpy
import pandas
label=['!','@','#','$','%']
datalist=[10,20,30,40,50]
a=pandas.Series(index=label,data=datalist)
print(a)

!    10
@    20
#    30
$    40
%    50
dtype: int64

In [17]:
print(pandas.Series(a))

!    10
@    20
#    30
$    40
%    50
dtype: int64

In [18]:
print(pandas.Series(datalist))

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [19]:
print(pandas.Series(datalist,label))

!    10
@    20
#    30
$    40
%    50
dtype: int64

In [20]:
import numpy
import pandas
mylist=[1,2,3,4,5]
sym=['!','@','#','$','%']
d={'!':1,'@':2,'#':3,'$':4,'%':5}
print(pandas.Series(d))

!    1
@    2
#    3
$    4
%    5
dtype: int64

In [22]:
print(pandas.Series(mylist))

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [30]:
print(pandas.Series(mylist,sym))

!    1
@    2
#    3
$    4
%    5
dtype: int64

In [35]:
import pandas
import numpy
print(pandas.Series([1,2,3,4],['USA','Germany','USSR','Japan']))

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [39]:
ser1=pandas.Series([1,2,3,4],index={'USA','Germany','USSR','Japan'})
ser2=pandas.Series([1,2,5,4],index={'USA','Germany','Italy','Japan'})
print(ser1)
print()
print(ser2)

USSR       1
USA        2
Germany    3
Japan      4
dtype: int64

Japan      1
USA        2
Germany    5
Italy      4
dtype: int64

In [40]:
print(ser1+ser2)

Germany    8.0
Italy      NaN
Japan      5.0
USA        4.0
USSR       NaN
dtype: float64

# Data Frames

In [45]:
import numpy
numpy.random.randn?

In [43]:
import numpy
import pandas
label=['!','@','#','$','%']
mylist=['Exclamation Mark','at the rate','hatch','Dollar','Percentage']
print(pandas.Series(index=label,data=mylist))

!    Exclamation Mark
@         at the rate
#               hatch
$              Dollar
%          Percentage
dtype: object

In [3]:
import numpy
import pandas
label=['!','@','#','*','&']
mydata=['exclamation','at the rate','hatch','asterisk','and']
print(pandas.Series(index=label,data=mydata))

!    exclamation
@    at the rate
#          hatch
*       asterisk
&            and
dtype: object

In [14]:
import numpy
import pandas
from numpy.random import randn
numpy.random.seed(101)
df=pandas.DataFrame(randn(5,4),index="A B C D E".split(),columns="1 2 3 4".split())
print(df)

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
print(type(df))
print(df['A']['1'])

<class 'pandas.core.frame.DataFrame'>

KeyError: 'A'

In [3]:
import numpy
import pandas
from numpy.random import randn
numpy.random.seed(101)
df=pandas.DataFrame(randn(5,4),index="A B C D E".split(),columns="1 2 3 4".split())
print(df)

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
print(df['1'])

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: 1, dtype: float64

In [7]:
print(type(df['1']))

<class 'pandas.core.series.Series'>

In [8]:
print(df['1']['B'])

0.6511179479432686

In [11]:
print(df[['1','3']])

          1         3
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [12]:
type(df['1'])

pandas.core.series.Series

In [13]:
df['99']=df['1']+df['2']

In [14]:
print(df)

          1         2         3         4        99
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [23]:
import pandas
import numpy
from numpy.random import randn
numpy.random.seed(101)
df=pandas.DataFrame(randn(5,4),index="A B C D E".split(),columns="1 2 3 4".split())
print(df)
print(df['1'])
print(df[['1','4']])
df['990']=df['1']+df['2']
print(df)
df.drop('990',axis=1,inplace=True)
print(df)

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: 1, dtype: float64
          1         4
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509
          1         2         3         4       990
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552
          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
import pandas
import numpy
from numpy.random import randn
numpy.random.seed(101)
df=pandas.DataFrame(randn(5,4),index='A B C D E'.split(),columns='1 2 3 4'.split())
print(df)

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
print(df['1'])

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: 1, dtype: float64

In [30]:
print(df[['1','3']])

          1         3
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [31]:
df['99']=df['1']+df['2']
print(df)

          1         2         3         4        99
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [33]:
df.drop('99',axis=1,inplace=True)
print(df)

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
print(df['1'])

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: 1, dtype: float64

In [35]:
print(df.loc['A'])

1    2.706850
2    0.628133
3    0.907969
4    0.503826
Name: A, dtype: float64

In [36]:
print(df.iloc[2])

1   -2.018168
2    0.740122
3    0.528813
4   -0.589001
Name: C, dtype: float64

In [37]:
print(df.loc[['B','C']])

          1         2         3         4
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [38]:
print(df.iloc[['1','3']])

          1         2         3         4
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [39]:
import pandas
import numpy
from numpy.random import randn
numpy.random.seed(101)
df=pandas.DataFrame(randn(5,4),index="A B C D E".split(),columns="1 2 3 4".split())
print(df)

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
print(df['1'])

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: 1, dtype: float64

In [44]:
print(df.loc['A'])

1    2.706850
2    0.628133
3    0.907969
4    0.503826
Name: A, dtype: float64

In [46]:
print(df.loc[['A','C']])

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [47]:
print(df.iloc[[1,3]])

          1         2         3         4
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [48]:
print(df.iloc[2])

1   -2.018168
2    0.740122
3    0.528813
4   -0.589001
Name: C, dtype: float64

In [50]:
print(df.loc[['A','C']['1','2']])

<>:1: SyntaxWarning: list indices must be integers or slices, not tuple; perhaps you missed a comma?
<>:1: SyntaxWarning: list indices must be integers or slices, not tuple; perhaps you missed a comma?
C:\Users\apurv\AppData\Local\Temp\ipykernel_3168\3250678793.py:1: SyntaxWarning: list indices must be integers or slices, not tuple; perhaps you missed a comma?
  print(df.loc[['A','C']['1','2']])

TypeError: list indices must be integers or slices, not tuple

In [51]:
print(df.loc['A'])

1    2.706850
2    0.628133
3    0.907969
4    0.503826
Name: A, dtype: float64

In [53]:
print(df.iloc[0])

1    2.706850
2    0.628133
3    0.907969
4    0.503826
Name: A, dtype: float64

In [55]:
print(df.loc[['A','B']])

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [56]:
print(df.iloc[[0,1]])

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [57]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df>0

       1      2      3      4
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [59]:
df[df>0]

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
df[df['1']<0]

          1         2         3         4
C -2.018168  0.740122  0.528813 -0.589001

In [64]:
df[df['2']>0]

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df[df['2']>0]

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df[df['2']>0]['3']

A    0.907969
C    0.528813
E    2.605967
Name: 3, dtype: float64

In [71]:
df[df['3']>0][['1','2']]

          1         2
A  2.706850  0.628133
C -2.018168  0.740122
E  0.190794  1.978757

In [72]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df[(df['1']>0) & (df['3']>0)]

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [78]:
df.iloc[[1,3]]

          1         2         3         4
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [80]:
df[df>0]

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
df[(df['1']>0) & (df['3']>0)]

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [83]:
df.reset_index()

  index         1         2         3         4
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [84]:
rewind='CA NY WY OR CO'.split()
print(rewind)

['CA', 'NY', 'WY', 'OR', 'CO']

In [85]:
df[['1','2']]

          1         2
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [89]:
df.iloc[[0,4]]

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [90]:
df['rewinding']=rewind

In [91]:
df

          1         2         3         4 rewinding
A  2.706850  0.628133  0.907969  0.503826        CA
B  0.651118 -0.319318 -0.848077  0.605965        NY
C -2.018168  0.740122  0.528813 -0.589001        WY
D  0.188695 -0.758872 -0.933237  0.955057        OR
E  0.190794  1.978757  2.605967  0.683509        CO

In [95]:
df.set_index('rewinding')

                  1         2         3         4
rewinding
CA         2.706850  0.628133  0.907969  0.503826
NY         0.651118 -0.319318 -0.848077  0.605965
WY        -2.018168  0.740122  0.528813 -0.589001
OR         0.188695 -0.758872 -0.933237  0.955057
CO         0.190794  1.978757  2.605967  0.683509

In [96]:
df

          1         2         3         4 rewinding
A  2.706850  0.628133  0.907969  0.503826        CA
B  0.651118 -0.319318 -0.848077  0.605965        NY
C -2.018168  0.740122  0.528813 -0.589001        WY
D  0.188695 -0.758872 -0.933237  0.955057        OR
E  0.190794  1.978757  2.605967  0.683509        CO

In [97]:
df.set_index('rewinding')

                  1         2         3         4
rewinding
CA         2.706850  0.628133  0.907969  0.503826
NY         0.651118 -0.319318 -0.848077  0.605965
WY        -2.018168  0.740122  0.528813 -0.589001
OR         0.188695 -0.758872 -0.933237  0.955057
CO         0.190794  1.978757  2.605967  0.683509